org/talks.org
#+title: Talks
#+export_file_name: talks
#+hugo_custom_front_matter: :hideBackToTop true :hidePagination true

- /Axiomatizations of Presburger Arithmetic With Powers/, [[https://mathematik.univie.ac.at/forschung/seminare/seminars-at-the-kgrc/research-seminar-in-model-theory/nachrichtenvolldarstellung-se/news/axiomatizations-of-presburger-arithmetic-with-powers/?no_cache=1&cHash=0bd305e3b95d39fee93c58749de4a310][Research Seminar in Model Theory, Universität Wien]], 27. May 2026
- /Axiomatizing the Universal Theory of Presburger With Powers/, [[https://www.math.uni-duesseldorf.de/~internet/GeSAMT/][GeSAMT -- Gemeinsames Seminar Algebra und Modelltheorie]], Bonn, 1. Nov 2025 

* Where else you might have met me
- [[https://www.mathematics.uni-bonn.de/him/programs/past/him-trimester-program-definability-decidability-and-computability][/Trimester Program: Definability, decidability, and computability/]], Hausdorff Research Institute for Mathematics, Bonn, 1. Sep -- 12. Dec 2025; including:
  - /Introductory School "Definability, Decidability, and Computability"/, 15. -- 19. Sep 
  - /Workshop "Definability in Number Theory and Arithmetic Geometry"/, 20. -- 24. Oct 
  - /Conference "Definability and Computability"/, 8. -- 12. Dec 
- [[https://dynaverse2025.mpi-sws.org/][/Algebraic methods in dynamics and particle physics/]], Max Planck Institute for Software Systems, Saarbrücken, 15. -- 17. Oct 2025



