content/talks.md
+++
title = "Talks"
draft = false
hideBackToTop = true
hidePagination = true
+++

-   _Axiomatizations of Presburger Arithmetic With Powers_, [Research Seminar in Model Theory, Universität Wien](https://mathematik.univie.ac.at/forschung/seminare/seminars-at-the-kgrc/research-seminar-in-model-theory/nachrichtenvolldarstellung-se/news/axiomatizations-of-presburger-arithmetic-with-powers/?no_cache=1&cHash=0bd305e3b95d39fee93c58749de4a310), 27. May 2026
-   _Axiomatizing the Universal Theory of Presburger With Powers_, [GeSAMT -- Gemeinsames Seminar Algebra und Modelltheorie](https://www.math.uni-duesseldorf.de/~internet/GeSAMT/), Bonn, 1. Nov 2025


## Where else you might have met me {#where-else-you-might-have-met-me}

-   [_Trimester Program: Definability, decidability, and computability_](https://www.mathematics.uni-bonn.de/him/programs/past/him-trimester-program-definability-decidability-and-computability), Hausdorff Research Institute for Mathematics, Bonn, 1. Sep -- 12. Dec 2025; including:
    -   _Introductory School "Definability, Decidability, and Computability"_, 15. -- 19. Sep
    -   _Workshop "Definability in Number Theory and Arithmetic Geometry"_, 20. -- 24. Oct
    -   _Conference "Definability and Computability"_, 8. -- 12. Dec
-   [_Algebraic methods in dynamics and particle physics_](https://dynaverse2025.mpi-sws.org/), Max Planck Institute for Software Systems, Saarbrücken, 15. -- 17. Oct 2025
